Revit 2020 API
RouteAnalysisSettings.IgnoreImports Property
 If true, import instances are ignored by route calculation.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 20.0.0.0 (20.0.0.377)
Since: 2020
Syntax
C#
public bool IgnoreImports { get; set; }
Visual Basic
Public Property IgnoreImports As Boolean
	Get
	Set
Visual C++
public:
property bool IgnoreImports {
	bool get ();
	void set (bool value);
}
See Also
RouteAnalysisSettings Class
Autodesk.Revit.DB.Analysis Namespace